# JupyterLab Connection Settings

In [1]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in /home/ersel/.local/lib/python3.8/site-packages (0.4.0)',
 'Requirement already satisfied: prettytable<1 in /home/ersel/.local/lib/python3.8/site-packages (from ipython-sql) (0.7.2)',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in /home/ersel/.local/lib/python3.8/site-packages (from ipython-sql) (1.4.36)',
 'Requirement already satisfied: six in /usr/lib/python3/dist-packages (from ipython-sql) (1.14.0)',
 'Requirement already satisfied: ipython>=1.0 in /home/ersel/.local/lib/python3.8/site-packages (from ipython-sql) (8.1.1)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in /home/ersel/.local/lib/python3.8/site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: sqlparse in /home/ersel/.local/lib/python3.8/site-packages (from ipython-sql) (0.4.2)',
 'Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" and (platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32")))))) in /home/ersel/.local/lib/python3.8/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.2)',
 'Requirement already satisfied: decorator in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)',
 'Requirement already satisfied: pygments>=2.4.0 in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (2.11.2)',
 'Requirement already satisfied: traitlets>=5 in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)',
 'Requirement already satisfied: pickleshare in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: stack-data in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)',
 'Requirement already satisfied: pexpect>4.3; sys_platform != "win32" in /usr/lib/python3/dist-packages (from ipython>=1.0->ipython-sql) (4.6.0)',
 'Requirement already satisfied: backcall in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)',
 'Requirement already satisfied: jedi>=0.16 in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.18.1)',
 'Requirement already satisfied: setuptools>=18.5 in /usr/lib/python3/dist-packages (from ipython>=1.0->ipython-sql) (45.2.0)',
 'Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (3.0.28)',
 'Requirement already satisfied: matplotlib-inline in /home/ersel/.local/lib/python3.8/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)',
 'Requirement already satisfied: pure-eval in /home/ersel/.local/lib/python3.8/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)',
 'Requirement already satisfied: executing in /home/ersel/.local/lib/python3.8/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)',
 'Requirement already satisfied: asttokens in /home/ersel/.local/lib/python3.8/site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.0 in /home/ersel/.local/lib/python3.8/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)',
 'Requirement already satisfied: wcwidth in /home/ersel/.local/lib/python3.8/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)']

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sql-examples.db

## Table creation process

In [12]:
%%sql
CREATE TABLE Workers(
    worker_id INT,
    first_name CHAR(25) NOT NULL,
    last_name CHAR(25) NOT NULL,
    salary INT(15),
    joining_date DATETIME NOT NULL,
    department CHAR(25));

 * sqlite:///sql-examples.db
Done.

[]

In [23]:
%%sql
INSERT INTO Workers(worker_id, first_name, last_name, salary, joining_date, department)
VALUES 
(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
(009, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist');

 * sqlite:///sql-examples.db
9 rows affected.

[]

In [25]:
%%sql
CREATE TABLE Bonus(
    worker_ref_id INT,
    bonus_amount INT(10),
    bonus_date DATETIME,
    FOREIGN KEY (worker_ref_id)
        REFERENCES Workers (woker_id)
    ON DELETE CASCADE);

 * sqlite:///sql-examples.db
Done.

[]

In [26]:
%%sql
INSERT INTO Bonus(worker_ref_id, bonus_amount, bonus_date)
VALUES
(001, 5000, '16-02-20'),
(002, 3000, '16-06-11'),
(003, 4000, '16-02,20'),
(001, 4500, '16-02-20'),
(002, 3500, '16-06-11');

 * sqlite:///sql-examples.db
5 rows affected.

[]

In [27]:
%%sql
CREATE TABLE Title(
    worker_ref_id INT,
	worker_title CHAR(25),
	affected_from DATETIME,
	FOREIGN KEY (worker_ref_id)
		REFERENCES Workers(worker_id)
        ON DELETE CASCADE
);

 * sqlite:///sql-examples.db
Done.

[]

In [29]:
%%sql
INSERT INTO Title (worker_ref_id, worker_title, affected_from) 
VALUES
(001, 'Manager', '2016-02-20 00:00:00'),
(002, 'Executive', '2016-06-11 00:00:00'),
(008, 'Executive', '2016-06-11 00:00:00'),
(005, 'Manager', '2016-06-11 00:00:00'),
(004, 'Asst. Manager', '2016-06-11 00:00:00'),
(007, 'Executive', '2016-06-11 00:00:00'),
(006, 'Lead', '2016-06-11 00:00:00'),
(003, 'Lead', '2016-06-11 00:00:00'),
(009, 'Senior', '2016-05-22 00:00:00');

 * sqlite:///sql-examples.db
9 rows affected.

[]

* ALL TABLES

In [30]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-examples.db
Done.

[('Workers',), ('Bonus',), ('Title',)]

In [32]:
# tablolarÄ±n column isimleri

In [31]:
%%sql
SELECT * FROM Workers WHERE 1 = 0;

 * sqlite:///sql-examples.db
Done.

[]

In [33]:
%%sql
SELECT * FROM Bonus WHERE 1 = 0;

 * sqlite:///sql-examples.db
Done.

[]

In [34]:
%%sql
SELECT * FROM Title WHERE 1 = 0;

 * sqlite:///sql-examples.db
Done.

[]

## SQL 50-QUESTIONS

### Q-1: Write an SQL query to fetch âfirst_nameâ from Workers table using the alias name as worker_name

In [35]:
%%sql
SELECT first_name AS worker_name FROM Workers

 * sqlite:///sql-examples.db
Done.

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',),
 ('Ersel',)]

### Q-2: Write an SQL query to fetch âfirst_nameâ from Workers table in upper case.

In [36]:
%%sql
SELECT upper(first_name) FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('MONIKA',),
 ('NIHARIKA',),
 ('VISHAL',),
 ('AMITABH',),
 ('VIVEK',),
 ('VIPUL',),
 ('SATISH',),
 ('GEETIKA',),
 ('ERSEL',)]

### Q-3: Write an SQL query to fetch unique values of department from Workers table.

In [37]:
%%sql
SELECT DISTINCT department FROM Workers

 * sqlite:///sql-examples.db
Done.

[('HR',), ('Admin',), ('Account',), ('DataScientist',)]

### Q-4: Write an SQL query to print the first three characters of first_name from Workers table.

In [61]:
%%sql
SELECT SUBSTR(first_name, 1, 3) AS letters3 FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('Mon',),
 ('Nih',),
 ('Vis',),
 ('Ami',),
 ('Viv',),
 ('Vip',),
 ('Sat',),
 ('Gee',),
 ('Ers',)]

### Q-5: Write an SQL query to find the position of the alphabet (âaâ) in the first_name column âAmitabhâ from Workers table.

In [62]:
%%sql
SELECT * FROM Workers
WHERE first_name 
LIKE 'a%';

 * sqlite:///sql-examples.db
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin')]

In [71]:
# daha sonra incele!

### Q-6: Write an SQL query to print the first_name from Workers table after removing white spaces from the right side.

In [73]:
%%sql
SELECT RTRIM(first_name) FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('Monika',),
 ('Niharika',),
 ('Vishal',),
 ('Amitabh',),
 ('Vivek',),
 ('Vipul',),
 ('Satish',),
 ('Geetika',),
 ('Ersel',)]

### Q-7: Write an SQL query to print the department from Workers table after removing white spaces from the left side.

In [74]:
%%sql
SELECT RTRIM(department) FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('HR',),
 ('Admin',),
 ('HR',),
 ('Admin',),
 ('Admin',),
 ('Account',),
 ('Account',),
 ('Admin',),
 ('DataScientist',)]

### Q-8: Write an SQL query that fetches the unique values of department from Workers table and prints its length.

In [78]:
%%sql
SELECT DISTINCT LENGTH(department) FROM Workers

 * sqlite:///sql-examples.db
Done.

[(2,), (5,), (7,), (13,)]

### Q-9: Write an SQL query to print the first_name from Workers table after replacing âaâ with âAâ.

In [79]:
%%sql
SELECT REPLACE(first_name, 'a', 'A') FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('MonikA',),
 ('NihArikA',),
 ('VishAl',),
 ('AmitAbh',),
 ('Vivek',),
 ('Vipul',),
 ('SAtish',),
 ('GeetikA',),
 ('Ersel',)]

### Q-10: Write an SQL query to print the first_name and last_name from Workers table into a single column complete_name. A space char should separate them.

In [81]:
%%sql
SELECT (first_name || ' ' || last_name) AS complete_name 
FROM Workers;

 * sqlite:///sql-examples.db
Done.

[('Monika Arora',),
 ('Niharika Verma',),
 ('Vishal Singhal',),
 ('Amitabh Singh',),
 ('Vivek Bhati',),
 ('Vipul Diwan',),
 ('Satish Kumar',),
 ('Geetika Chauhan',),
 ('Ersel KÄ±zmaz',)]

### Q-11: Write an SQL query to print all Workers details from the Workers table order by first_name Ascending.

In [85]:
%%sql
SELECT * FROM Workers 
ORDER BY first_name ASC;

 * sqlite:///sql-examples.db
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')]

### Q-12: Write an SQL query to print all Workers details from the Workers table order by first_name Ascending and department Descending.

In [89]:
%%sql
SELECT * FROM Workers
ORDER BY first_name ASC, department DESC;

 * sqlite:///sql-examples.db
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')]

### Q-13: Write an SQL query to print details for workers with the first_name as âVipulâ and âSatishâ from Workers table.

In [91]:
%%sql
SELECT * FROM Workers
WHERE first_name IN ('Vipul', 'Satish');

 * sqlite:///sql-examples.db
Done.

[(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

### Q-14: Write an SQL query to print details of workers excluding first names, âVipulâ and âSatishâ from Workers table.

In [92]:
%%sql
SELECT * FROM Workers
WHERE first_name NOT IN ('Vipul', 'Satish');

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist')]

### Q-15: Write an SQL query to print details of Workers with department name as âAdminâ.

In [93]:
%%sql
SELECT * FROM Workers
WHERE department = 'Admin';

 * sqlite:///sql-examples.db
Done.

[(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-16: Write an SQL query to print details of the Workers whose first_name contains âaâ.

In [95]:
%%sql
SELECT * FROM Workers
WHERE first_name
LIKE '%a%';

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-17: Write an SQL query to print details of the Workers whose first_name ends with âaâ.

In [97]:
%%sql
SELECT * FROM Workers
WHERE first_name
LIKE '%a';

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-18: Write an SQL query to print details of the Workers whose first_name ends with âhâ and contains six alphabets.

In [98]:
%%sql
SELECT * FROM Workers
WHERE first_name
LIKE '_____h%'

 * sqlite:///sql-examples.db
Done.

[(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

### Q-19: Write an SQL query to print details of the Workers whose salary lies between 100000 and 500000.

In [99]:
%%sql
SELECT * FROM Workers
WHERE salary
BETWEEN 100000 AND 500000;

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist')]

### Q-20: Write an SQL query to print details of the Workers who have joined in Febâ2014.

In [30]:
%%sql
SELECT * FROM Workers
WHERE joining_date 
LIKE '%14-02%';

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin')]

### Q-21: Write an SQL query to fetch the count of employees working in the department âAdminâ.

In [40]:
%%sql
SELECT SUM(department = 'Admin') FROM Workers;

 * sqlite:///sql-examples.db
Done.

[(4,)]

In [41]:
%%sql
SELECT COUNT(*) FROM Workers
WHERE department = 'Admin';

 * sqlite:///sql-examples.db
Done.

[(4,)]

### Q-22: Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000.

In [44]:
%%sql
SELECT * FROM Workers
WHERE Salary BETWEEN 50000 AND 100000

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

In [46]:
%%sql
SELECT first_name || ' ' || last_name As Worker_Name, salary
FROM Workers
WHERE worker_id IN 
(SELECT worker_id FROM Workers
WHERE salary BETWEEN 50000 AND 100000);

 * sqlite:///sql-examples.db
Done.

[('Monika Arora', 100000),
 ('Niharika Verma', 80000),
 ('Satish Kumar', 75000),
 ('Geetika Chauhan', 90000)]

### Q-23: Write an SQL query to fetch the no. of workers for each department in the descending order.

In [62]:
%%sql
SELECT department, COUNT(department) AS counts FROM Workers
GROUP BY department
ORDER BY counts DESC;

 * sqlite:///sql-examples.db
Done.

[('Admin', 4), ('HR', 2), ('Account', 2), ('DataScientist', 1)]

### Q-24: Write an SQL query to print details of the Workers who are also Managers.

In [68]:
%%sql
SELECT DISTINCT w.first_name, w.department, t.worker_title 
FROM Workers w
INNER JOIN title T
ON worker_id = t.worker_ref_id
AND t.worker_title IN ('Manager');

 * sqlite:///sql-examples.db
Done.

[('Monika', 'HR', 'Manager'), ('Vivek', 'Admin', 'Manager')]

### Q-25: Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [3]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-examples.db
Done.

[('Workers',), ('Bonus',), ('Title',)]

In [12]:
%%sql
SELECT * FROM Workers;

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist')]

In [13]:
%%sql
SELECT * FROM Bonus;

 * sqlite:///sql-examples.db
Done.

[(1, 5000, '16-02-20'),
 (2, 3000, '16-06-11'),
 (3, 4000, '16-02,20'),
 (1, 4500, '16-02-20'),
 (2, 3500, '16-06-11')]

In [14]:
%%sql
SELECT * FROM Title;

 * sqlite:///sql-examples.db
Done.

[(1, 'Manager', '2016-02-20 00:00:00'),
 (2, 'Executive', '2016-06-11 00:00:00'),
 (8, 'Executive', '2016-06-11 00:00:00'),
 (5, 'Manager', '2016-06-11 00:00:00'),
 (4, 'Asst. Manager', '2016-06-11 00:00:00'),
 (7, 'Executive', '2016-06-11 00:00:00'),
 (6, 'Lead', '2016-06-11 00:00:00'),
 (3, 'Lead', '2016-06-11 00:00:00'),
 (9, 'Senior', '2016-05-22 00:00:00')]

* ortak olan sÃ¼tun: 'worker_id'

In [11]:
%%sql
SELECT w.worker_id, w.first_name, b.bonus_amount
FROM Workers AS w
INNER JOIN Bonus AS b ON w.worker_id = b.worker_ref_id;

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 4500),
 (1, 'Monika', 5000),
 (2, 'Niharika', 3000),
 (2, 'Niharika', 3500),
 (3, 'Vishal', 4000)]

In [8]:
%%sql
SELECT worker_title, affected_from, COUNT(*)
FROM Title
GROUP BY worker_title, affected_from
HAVING COUNT(*) > 1;

 * sqlite:///sql-examples.db
Done.

[('Executive', '2016-06-11 00:00:00', 3), ('Lead', '2016-06-11 00:00:00', 2)]

### Q-26: Write an SQL query to show only odd rows from a table.

In [14]:
%%sql
SELECT * FROM Workers
WHERE worker_id % 2 = 1;

 * sqlite:///sql-examples.db
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (9, 'Ersel', 'KÄ±zmaz', 122000, '14-05-2022 09.00.00', 'DataScientist')]

### Q-27: Write an SQL query to show only even rows from a table.

In [15]:
%%sql
SELECT * FROM Workers
WHERE worker_id % 2 = 0;

 * sqlite:///sql-examples.db
Done.

[(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

In [23]:
### Q-28: Write an SQL query to clone a new table from another table.

In [26]:
### Q-29: Write an SQL query to fetch intersecting records of two tables.

In [ ]:
### Q-30: Write an SQL query to show records from one table that another table does not have.

In [ ]:
### Q-31:

In [ ]:
### Q-32:

In [ ]:
### Q-33:

In [ ]:
### Q-34:

In [ ]:
### Q-35:

In [ ]:
### Q-36:

In [ ]:
### Q-37:

In [ ]:
### Q-38:

In [ ]:
### Q-39:

In [ ]:
### Q-40:

In [ ]:
### Q-41:

In [ ]:
### Q-42:

In [ ]:
### Q-43:

In [ ]:
### Q-44:

In [ ]:
### Q-45:

In [ ]:
### Q-46:

In [ ]:
### Q-47:

In [ ]:
### Q-48:

In [ ]:
### Q-49:

In [ ]:
### Q-50: